porousFlowCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Image dimensions (80x80 pixels)
lx0 0;
ly0 0;
lz0 0;

lx1 80;
ly1 80;
lz1 1;

vertices
(
    ($lx0 $ly0 $lz0)   //0
    ($lx1 $ly0 $lz0)   //1
    ($lx1 $ly1 $lz0)   //2
    ($lx0 $ly1 $lz0)   //3
    ($lx0 $ly0 $lz1)   //4
    ($lx1 $ly0 $lz1)   //5
    ($lx1 $ly1 $lz1)   //6
    ($lx0 $ly1 $lz1)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    
    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* // 